<?xml version="1.0" ?>
<net name="3d_unet_decathlon_tf_ov_fp32_ir" version="11">
	<layers>
		<layer id="0" name="mrimages" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,144,144,144,1"/>
			<rt_info>
				<attribute name="fused_names" value="mrimages" version="0"/>
				<attribute name="old_api_map_order" value="0, 2, 3, 4, 1" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="Func/StatefulPartitionedCall/input/_0:0,mrimages,mrimages:0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="mrimages/Transpose([0 4 1 2 3])/value926813623" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="5" size="40"/>
			<rt_info>
				<attribute name="fused_names" value="mrimages/Transpose([0 4 1 2 3])/value926813623" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="mrimages/Transpose([0 4 1 2 3])" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="mrimages/Transpose([0 4 1 2 3])" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/3d_unet_decathlon/encode_a_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="40" shape="16, 1, 3, 3, 3" size="1728"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_a_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/encode_a_conv_0/Conv3D/ReadVariableOp:0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/3d_unet_decathlon/encode_a_conv_0/Conv3D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_a_conv_0/Conv3D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="data_add_7010" type="Const" version="opset1">
			<data element_type="f32" offset="1768" shape="1, 16, 1, 1, 1" size="64"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_7010" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/3d_unet_decathlon/encode_a_conv_0/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_a_conv_0/BiasAdd/Add/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/3d_unet_decathlon/encode_a_bn_0/FusedBatchNormV3:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/3d_unet_decathlon/encode_a_relu_0/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_a_relu_0/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/3d_unet_decathlon/encode_a_relu_0/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/3d_unet_decathlon/encode_a_bn_1/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="1832" shape="16, 16, 3, 3, 3" size="27648"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_a_bn_1/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/encode_a_conv_1/Conv3D/ReadVariableOp:0" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/3d_unet_decathlon/encode_a_conv_1/Conv3D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_a_conv_1/Conv3D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="data_add_70137018" type="Const" version="opset1">
			<data element_type="f32" offset="29480" shape="1, 16, 1, 1, 1" size="64"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_70137018" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/3d_unet_decathlon/encode_a_conv_1/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_a_conv_1/BiasAdd/Add/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/3d_unet_decathlon/encode_a_bn_1/FusedBatchNormV3:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/3d_unet_decathlon/encode_a/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_a/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/3d_unet_decathlon/encode_a/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/3d_unet_decathlon/pool_a/MaxPool3D" type="MaxPool" version="opset8">
			<data auto_pad="valid" axis="0" dilations="1, 1, 1" index_element_type="i64" kernel="2, 2, 2" pads_begin="0, 0, 0" pads_end="0, 0, 0" rounding_type="floor" strides="2, 2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/pool_a/MaxPool3D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/3d_unet_decathlon/pool_a/MaxPool3D:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/3d_unet_decathlon/encode_b_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="29544" shape="32, 16, 3, 3, 3" size="55296"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_b_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/encode_b_conv_0/Conv3D/ReadVariableOp:0" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/3d_unet_decathlon/encode_b_conv_0/Conv3D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_b_conv_0/Conv3D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="data_add_70217026" type="Const" version="opset1">
			<data element_type="f32" offset="84840" shape="1, 32, 1, 1, 1" size="128"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_70217026" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/3d_unet_decathlon/encode_b_conv_0/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_b_conv_0/BiasAdd/Add/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/3d_unet_decathlon/encode_b_bn_0/FusedBatchNormV3:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/3d_unet_decathlon/encode_b_relu_0/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_b_relu_0/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/3d_unet_decathlon/encode_b_relu_0/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/3d_unet_decathlon/encode_b_bn_1/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="84968" shape="32, 32, 3, 3, 3" size="110592"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_b_bn_1/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/encode_b_conv_1/Conv3D/ReadVariableOp:0" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/3d_unet_decathlon/encode_b_conv_1/Conv3D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_b_conv_1/Conv3D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="data_add_70297034" type="Const" version="opset1">
			<data element_type="f32" offset="195560" shape="1, 32, 1, 1, 1" size="128"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_70297034" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/3d_unet_decathlon/encode_b_conv_1/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_b_conv_1/BiasAdd/Add/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/3d_unet_decathlon/encode_b_bn_1/FusedBatchNormV3:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/3d_unet_decathlon/encode_b/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_b/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/3d_unet_decathlon/encode_b/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/3d_unet_decathlon/pool_b/MaxPool3D" type="MaxPool" version="opset8">
			<data auto_pad="valid" axis="0" dilations="1, 1, 1" index_element_type="i64" kernel="2, 2, 2" pads_begin="0, 0, 0" pads_end="0, 0, 0" rounding_type="floor" strides="2, 2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/pool_b/MaxPool3D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>72</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/3d_unet_decathlon/pool_b/MaxPool3D:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/3d_unet_decathlon/encode_c_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="195688" shape="64, 32, 3, 3, 3" size="221184"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_c_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/encode_c_conv_0/Conv3D/ReadVariableOp:0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/3d_unet_decathlon/encode_c_conv_0/Conv3D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_c_conv_0/Conv3D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="data_add_70377042" type="Const" version="opset1">
			<data element_type="f32" offset="416872" shape="1, 64, 1, 1, 1" size="256"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_70377042" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/3d_unet_decathlon/encode_c_conv_0/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_c_conv_0/BiasAdd/Add/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/3d_unet_decathlon/encode_c_bn_0/FusedBatchNormV3:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/3d_unet_decathlon/encode_c_relu_0/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_c_relu_0/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/3d_unet_decathlon/encode_c_relu_0/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/3d_unet_decathlon/encode_c_bn_1/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="417128" shape="64, 64, 3, 3, 3" size="442368"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_c_bn_1/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/encode_c_conv_1/Conv3D/ReadVariableOp:0" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/3d_unet_decathlon/encode_c_conv_1/Conv3D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_c_conv_1/Conv3D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="data_add_70457050" type="Const" version="opset1">
			<data element_type="f32" offset="859496" shape="1, 64, 1, 1, 1" size="256"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_70457050" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/3d_unet_decathlon/encode_c_conv_1/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_c_conv_1/BiasAdd/Add/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/3d_unet_decathlon/encode_c_bn_1/FusedBatchNormV3:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/3d_unet_decathlon/encode_c/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_c/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/3d_unet_decathlon/encode_c/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/3d_unet_decathlon/pool_c/MaxPool3D" type="MaxPool" version="opset8">
			<data auto_pad="valid" axis="0" dilations="1, 1, 1" index_element_type="i64" kernel="2, 2, 2" pads_begin="0, 0, 0" pads_end="0, 0, 0" rounding_type="floor" strides="2, 2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/pool_c/MaxPool3D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/3d_unet_decathlon/pool_c/MaxPool3D:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/3d_unet_decathlon/encode_d_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="859752" shape="128, 64, 3, 3, 3" size="884736"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_d_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/encode_d_conv_0/Conv3D/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/3d_unet_decathlon/encode_d_conv_0/Conv3D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_d_conv_0/Conv3D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="data_add_70537058" type="Const" version="opset1">
			<data element_type="f32" offset="1744488" shape="1, 128, 1, 1, 1" size="512"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_70537058" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/3d_unet_decathlon/encode_d_conv_0/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_d_conv_0/BiasAdd/Add/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/3d_unet_decathlon/encode_d_bn_0/FusedBatchNormV3:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/3d_unet_decathlon/encode_d_relu_0/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_d_relu_0/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/3d_unet_decathlon/encode_d_relu_0/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/3d_unet_decathlon/encode_d_bn_1/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="1745000" shape="128, 128, 3, 3, 3" size="1769472"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_d_bn_1/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/encode_d_conv_1/Conv3D/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/3d_unet_decathlon/encode_d_conv_1/Conv3D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_d_conv_1/Conv3D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="data_add_70617066" type="Const" version="opset1">
			<data element_type="f32" offset="3514472" shape="1, 128, 1, 1, 1" size="512"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_70617066" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/3d_unet_decathlon/encode_d_conv_1/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_d_conv_1/BiasAdd/Add/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/3d_unet_decathlon/encode_d_bn_1/FusedBatchNormV3:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/3d_unet_decathlon/encode_d/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_d/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/3d_unet_decathlon/encode_d/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/3d_unet_decathlon/pool_d/MaxPool3D" type="MaxPool" version="opset8">
			<data auto_pad="valid" axis="0" dilations="1, 1, 1" index_element_type="i64" kernel="2, 2, 2" pads_begin="0, 0, 0" pads_end="0, 0, 0" rounding_type="floor" strides="2, 2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/pool_d/MaxPool3D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/3d_unet_decathlon/pool_d/MaxPool3D:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/3d_unet_decathlon/encode_e_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="3514984" shape="256, 128, 3, 3, 3" size="3538944"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_e_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/encode_e_conv_0/Conv3D/ReadVariableOp:0" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/3d_unet_decathlon/encode_e_conv_0/Conv3D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_e_conv_0/Conv3D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>9</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="data_add_70697074" type="Const" version="opset1">
			<data element_type="f32" offset="7053928" shape="1, 256, 1, 1, 1" size="1024"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_70697074" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/3d_unet_decathlon/encode_e_conv_0/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_e_conv_0/BiasAdd/Add/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>9</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/3d_unet_decathlon/encode_e_bn_0/FusedBatchNormV3:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>9</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/3d_unet_decathlon/encode_e_relu_0/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_e_relu_0/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>9</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/3d_unet_decathlon/encode_e_relu_0/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>9</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/3d_unet_decathlon/encode_e_bn_1/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" offset="7054952" shape="256, 256, 3, 3, 3" size="7077888"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_e_bn_1/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/encode_e_conv_1/Conv3D/ReadVariableOp:0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/3d_unet_decathlon/encode_e_conv_1/Conv3D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1, 1" pads_begin="0, 0, 0" pads_end="0, 0, 0" strides="1, 1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_e_conv_1/Conv3D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>9</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>9</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="data_add_70777082" type="Const" version="opset1">
			<data element_type="f32" offset="14132840" shape="1, 256, 1, 1, 1" size="1024"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_70777082" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/3d_unet_decathlon/encode_e_conv_1/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_e_conv_1/BiasAdd/Add/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>9</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/3d_unet_decathlon/encode_e_bn_1/FusedBatchNormV3:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>9</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/3d_unet_decathlon/encode_e/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_e/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>9</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/3d_unet_decathlon/encode_e/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>9</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/conv3d_transpose/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="14133864" shape="256, 128, 2, 2, 2" size="1048576"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/conv3d_transpose/ReadVariableOp" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/conv3d_transpose/ReadVariableOp:0" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>2</dim>
					<dim>2</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/Shape" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>9</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/Shape/GatherNCHWtoNHWC_input_port_1/value907813617" type="Const" version="opset1">
			<data element_type="i32" offset="15182440" shape="5" size="20"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/Shape/GatherNCHWtoNHWC_input_port_1/value907813617" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/Shape/GatherNCHWtoNHWC_input_port_2/value908013479" type="Const" version="opset1">
			<data element_type="i64" offset="15182460" shape="" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/Shape/GatherNCHWtoNHWC_input_port_2/value908013479" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/Shape/GatherNCHWtoNHWC" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/Shape/GatherNCHWtoNHWC, StatefulPartitionedCall/3d_unet_decathlon/transconv_e/Shape/GatherNCHWtoNHWC_input_port_1/value907813617, StatefulPartitionedCall/3d_unet_decathlon/transconv_e/Shape/GatherNCHWtoNHWC_input_port_2/value908013479" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>5</dim>
				</port>
				<port id="1" precision="I32">
					<dim>5</dim>
				</port>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" names="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/Shape:0" precision="I32">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i64" offset="15182460" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice/stack" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice/stack:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i64" offset="15182468" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice/stack_1" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice/stack_1:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i64" offset="15182468" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice/stack_2" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice/stack_2:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice, StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice/stack, StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice/stack_1, StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice/stack_2" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>5</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice:0" precision="I32"/>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/stack/Unsqueeze_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="15182460" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/stack/Unsqueeze_input_port_1/value" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/stack/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/stack/Unsqueeze, StatefulPartitionedCall/3d_unet_decathlon/transconv_e/stack/Unsqueeze_input_port_1/value" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I32"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice_1/stack" type="Const" version="opset1">
			<data element_type="i64" offset="15182468" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice_1/stack" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice_1/stack:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice_1/stack_1" type="Const" version="opset1">
			<data element_type="i64" offset="15182476" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice_1/stack_1" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice_1/stack_1:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice_1/stack_2" type="Const" version="opset1">
			<data element_type="i64" offset="15182468" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice_1/stack_2" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice_1/stack_2:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice_1" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice_1, StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice_1/stack, StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice_1/stack_1, StatefulPartitionedCall/3d_unet_decathlon/transconv_e/strided_slice_1/stack_2" version="0"/>
			</rt_info>
