<?xml version="1.0" ?>
<net name="3d_unet_decathlon_tf_ov_fp32_ir" version="11">
	<layers>
		<layer id="147" name="mrimages" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,144,144,144,1"/>
			<rt_info>
				<attribute name="fused_names" value="mrimages" version="0"/>
				<attribute name="old_api_map_order" value="0,2,3,4,1" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="Func/StatefulPartitionedCall/input/_0:0,mrimages,mrimages:0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>1</dim>
					<rt_info/>
				</port>
			</output>
		</layer>
		<layer id="0" name="126512695244" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="1" name="126612705286" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="2" name="126712714956" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="3" name="126812724944" type="Const" version="opset1">
			<data element_type="f32" offset="4" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="4" name="164516495310" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="5" name="164616505316" type="Const" version="opset1">
			<data element_type="f32" offset="8" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="6" name="164716514644" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="7" name="164816525304" type="Const" version="opset1">
			<data element_type="f32" offset="8" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="8" name="137513795454" type="Const" version="opset1">
			<data element_type="f32" offset="12" shape="16,1,1,1,1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="137613805295" type="Const" version="opset1">
			<data element_type="f32" offset="76" shape="16,1,1,1,1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="137713814707" type="Const" version="opset1">
			<data element_type="f32" offset="12" shape="16,1,1,1,1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="137813825475" type="Const" version="opset1">
			<data element_type="f32" offset="76" shape="16,1,1,1,1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/3d_unet_decathlon/conv_out_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy5885325" type="Const" version="opset1">
			<data element_type="f32" offset="140" shape="16,32,3,3,3" size="55296"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/conv_out_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/conv_out_conv_0/Conv3D/ReadVariableOp:0" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/3d_unet_decathlon/conv_out_conv_0/Conv3D/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="204620505511" type="Const" version="opset1">
			<data element_type="f32" offset="55436" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="15" name="204720514920" type="Const" version="opset1">
			<data element_type="f32" offset="55440" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="16" name="204820525463" type="Const" version="opset1">
			<data element_type="f32" offset="55436" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="17" name="204920534668" type="Const" version="opset1">
			<data element_type="f32" offset="55440" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="18" name="162516295283" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="19" name="162616304971" type="Const" version="opset1">
			<data element_type="f32" offset="55444" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="20" name="162716315409" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="21" name="162816325427" type="Const" version="opset1">
			<data element_type="f32" offset="55444" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="22" name="146514695163" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="23" name="146614705238" type="Const" version="opset1">
			<data element_type="f32" offset="55448" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="24" name="146714715520" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="25" name="146814725472" type="Const" version="opset1">
			<data element_type="f32" offset="55448" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="26" name="139513995442" type="Const" version="opset1">
			<data element_type="f32" offset="55452" shape="32,1,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="139614004866" type="Const" version="opset1">
			<data element_type="f32" offset="55580" shape="32,1,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="139714014770" type="Const" version="opset1">
			<data element_type="f32" offset="55452" shape="32,1,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="139814024695" type="Const" version="opset1">
			<data element_type="f32" offset="55580" shape="32,1,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/3d_unet_decathlon/decode_a_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy5294890" type="Const" version="opset1">
			<data element_type="f32" offset="55708" shape="32,64,3,3,3" size="221184"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/decode_a_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/decode_a_conv_0/Conv3D/ReadVariableOp:0" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/3d_unet_decathlon/decode_a_conv_0/Conv3D/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="206620705583" type="Const" version="opset1">
			<data element_type="f32" offset="276892" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="33" name="206720715418" type="Const" version="opset1">
			<data element_type="f32" offset="276896" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="34" name="206820724899" type="Const" version="opset1">
			<data element_type="f32" offset="276892" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="35" name="206920735277" type="Const" version="opset1">
			<data element_type="f32" offset="276896" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="36" name="132513295289" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="37" name="132613304812" type="Const" version="opset1">
			<data element_type="f32" offset="276900" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="38" name="132713315514" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="39" name="132813325214" type="Const" version="opset1">
			<data element_type="f32" offset="276900" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="40" name="128512895502" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="41" name="128612904977" type="Const" version="opset1">
			<data element_type="f32" offset="276904" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="42" name="128712915508" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="43" name="128812924629" type="Const" version="opset1">
			<data element_type="f32" offset="276904" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="44" name="169516994980" type="Const" version="opset1">
			<data element_type="f32" offset="276908" shape="64,1,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="169617004965" type="Const" version="opset1">
			<data element_type="f32" offset="277164" shape="64,1,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="169717014632" type="Const" version="opset1">
			<data element_type="f32" offset="276908" shape="64,1,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="169817024815" type="Const" version="opset1">
			<data element_type="f32" offset="277164" shape="64,1,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/3d_unet_decathlon/decode_b_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy4705247" type="Const" version="opset1">
			<data element_type="f32" offset="277420" shape="64,128,3,3,3" size="884736"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/decode_b_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/decode_b_conv_0/Conv3D/ReadVariableOp:0" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/3d_unet_decathlon/decode_b_conv_0/Conv3D/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="208620904656" type="Const" version="opset1">
			<data element_type="f32" offset="1162156" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="51" name="208720914923" type="Const" version="opset1">
			<data element_type="f32" offset="1162160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="52" name="208820924833" type="Const" version="opset1">
			<data element_type="f32" offset="1162156" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="53" name="208920935043" type="Const" version="opset1">
			<data element_type="f32" offset="1162160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="54" name="144514495220" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="55" name="144614504893" type="Const" version="opset1">
			<data element_type="f32" offset="1162164" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="56" name="144714515436" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="57" name="144814525328" type="Const" version="opset1">
			<data element_type="f32" offset="1162164" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="58" name="130513094713" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="59" name="130613104929" type="Const" version="opset1">
			<data element_type="f32" offset="1162168" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="60" name="130713114794" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="61" name="130813124779" type="Const" version="opset1">
			<data element_type="f32" offset="1162168" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="62" name="155515594650" type="Const" version="opset1">
			<data element_type="f32" offset="1162172" shape="128,1,1,1,1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="155615605070" type="Const" version="opset1">
			<data element_type="f32" offset="1162684" shape="128,1,1,1,1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="155715614917" type="Const" version="opset1">
			<data element_type="f32" offset="1162172" shape="128,1,1,1,1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="155815625223" type="Const" version="opset1">
			<data element_type="f32" offset="1162684" shape="128,1,1,1,1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/3d_unet_decathlon/decode_c_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy4114599" type="Const" version="opset1">
			<data element_type="f32" offset="1163196" shape="128,256,3,3,3" size="3538944"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/decode_c_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/decode_c_conv_0/Conv3D/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="StatefulPartitionedCall/3d_unet_decathlon/decode_c_conv_0/Conv3D/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="210621105559" type="Const" version="opset1">
			<data element_type="f32" offset="4702140" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="69" name="210721114653" type="Const" version="opset1">
			<data element_type="f32" offset="4702144" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="70" name="210821124716" type="Const" version="opset1">
			<data element_type="f32" offset="4702140" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="71" name="210921135280" type="Const" version="opset1">
			<data element_type="f32" offset="4702144" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="72" name="160516095379" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="73" name="160616105259" type="Const" version="opset1">
			<data element_type="f32" offset="4702148" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="74" name="160716114617" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="75" name="160816125049" type="Const" version="opset1">
			<data element_type="f32" offset="4702148" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="76" name="140514095424" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="77" name="140614105364" type="Const" version="opset1">
			<data element_type="f32" offset="4702152" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="78" name="140714114836" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="79" name="140814125400" type="Const" version="opset1">
			<data element_type="f32" offset="4702152" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="80" name="167516794701" type="Const" version="opset1">
			<data element_type="f32" offset="4702156" shape="256,1,1,1,1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="167616805157" type="Const" version="opset1">
			<data element_type="f32" offset="4703180" shape="256,1,1,1,1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="167716814722" type="Const" version="opset1">
			<data element_type="f32" offset="4702156" shape="256,1,1,1,1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="167816824872" type="Const" version="opset1">
			<data element_type="f32" offset="4703180" shape="256,1,1,1,1" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="StatefulPartitionedCall/3d_unet_decathlon/encode_e_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy3525406" type="Const" version="opset1">
			<data element_type="f32" offset="4704204" shape="256,128,3,3,3" size="3538944"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_e_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/encode_e_conv_0/Conv3D/ReadVariableOp:0" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="StatefulPartitionedCall/3d_unet_decathlon/encode_e_conv_0/Conv3D/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="211621205349" type="Const" version="opset1">
			<data element_type="f32" offset="4702140" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="87" name="211721214677" type="Const" version="opset1">
			<data element_type="f32" offset="4702144" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="88" name="211821225340" type="Const" version="opset1">
			<data element_type="f32" offset="4702140" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="89" name="211921234623" type="Const" version="opset1">
			<data element_type="f32" offset="4702144" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="90" name="156515695529" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="91" name="156615705403" type="Const" version="opset1">
			<data element_type="f32" offset="8243148" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="92" name="156715715346" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="93" name="156815725337" type="Const" version="opset1">
			<data element_type="f32" offset="8243148" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="94" name="143514395460" type="Const" version="opset1">
			<data element_type="f32" offset="8243152" shape="128,1,1,1,1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="143614404728" type="Const" version="opset1">
			<data element_type="f32" offset="8243664" shape="128,1,1,1,1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="143714415268" type="Const" version="opset1">
			<data element_type="f32" offset="8243152" shape="128,1,1,1,1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="143814425334" type="Const" version="opset1">
			<data element_type="f32" offset="8243664" shape="128,1,1,1,1" size="512"/>
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="StatefulPartitionedCall/3d_unet_decathlon/encode_d_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy3414584" type="Const" version="opset1">
			<data element_type="f32" offset="8244176" shape="128,64,3,3,3" size="884736"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_d_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/encode_d_conv_0/Conv3D/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="StatefulPartitionedCall/3d_unet_decathlon/encode_d_conv_0/Conv3D/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="209621004743" type="Const" version="opset1">
			<data element_type="f32" offset="1162156" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="101" name="209721014881" type="Const" version="opset1">
			<data element_type="f32" offset="1162160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="102" name="209821025121" type="Const" version="opset1">
			<data element_type="f32" offset="1162156" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="103" name="209921035352" type="Const" version="opset1">
			<data element_type="f32" offset="1162160" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="104" name="124512494719" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="105" name="124612505184" type="Const" version="opset1">
			<data element_type="f32" offset="9128912" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="106" name="124712515250" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="107" name="124812525130" type="Const" version="opset1">
			<data element_type="f32" offset="9128912" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="108" name="135513594851" type="Const" version="opset1">
			<data element_type="f32" offset="9128916" shape="64,1,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="135613604737" type="Const" version="opset1">
			<data element_type="f32" offset="9129172" shape="64,1,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="135713614749" type="Const" version="opset1">
			<data element_type="f32" offset="9128916" shape="64,1,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="135813625388" type="Const" version="opset1">
			<data element_type="f32" offset="9129172" shape="64,1,1,1,1" size="256"/>
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="StatefulPartitionedCall/3d_unet_decathlon/encode_c_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy3304896" type="Const" version="opset1">
			<data element_type="f32" offset="9129428" shape="64,32,3,3,3" size="221184"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_c_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/encode_c_conv_0/Conv3D/ReadVariableOp:0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="StatefulPartitionedCall/3d_unet_decathlon/encode_c_conv_0/Conv3D/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="207620805028" type="Const" version="opset1">
			<data element_type="f32" offset="276892" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="115" name="207720815421" type="Const" version="opset1">
			<data element_type="f32" offset="276896" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="116" name="207820825196" type="Const" version="opset1">
			<data element_type="f32" offset="276892" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="117" name="207920835265" type="Const" version="opset1">
			<data element_type="f32" offset="276896" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="118" name="158515895193" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="119" name="158615905523" type="Const" version="opset1">
			<data element_type="f32" offset="9350612" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="120" name="158715915448" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="121" name="158815925037" type="Const" version="opset1">
			<data element_type="f32" offset="9350612" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="122" name="153515395112" type="Const" version="opset1">
			<data element_type="f32" offset="9350616" shape="32,1,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="153615405568" type="Const" version="opset1">
			<data element_type="f32" offset="9350744" shape="32,1,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="153715415229" type="Const" version="opset1">
			<data element_type="f32" offset="9350616" shape="32,1,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="153815424758" type="Const" version="opset1">
			<data element_type="f32" offset="9350744" shape="32,1,1,1,1" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="StatefulPartitionedCall/3d_unet_decathlon/encode_b_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy3195091" type="Const" version="opset1">
			<data element_type="f32" offset="9350872" shape="32,16,3,3,3" size="55296"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_b_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/encode_b_conv_0/Conv3D/ReadVariableOp:0" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="StatefulPartitionedCall/3d_unet_decathlon/encode_b_conv_0/Conv3D/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="205620604638" type="Const" version="opset1">
			<data element_type="f32" offset="55436" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="129" name="205720615124" type="Const" version="opset1">
			<data element_type="f32" offset="55440" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="130" name="205820624785" type="Const" version="opset1">
			<data element_type="f32" offset="55436" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="131" name="205920635073" type="Const" version="opset1">
			<data element_type="f32" offset="55440" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="132" name="148514894845" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="133" name="148614905067" type="Const" version="opset1">
			<data element_type="f32" offset="9406168" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="134" name="148714915415" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="135" name="148814924674" type="Const" version="opset1">
			<data element_type="f32" offset="9406168" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="136" name="151515194848" type="Const" version="opset1">
			<data element_type="f32" offset="9406172" shape="16,1,1,1,1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="151615204860" type="Const" version="opset1">
			<data element_type="f32" offset="9406236" shape="16,1,1,1,1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="151715214665" type="Const" version="opset1">
			<data element_type="f32" offset="9406300" shape="16,1,1,1,1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="151815224596" type="Const" version="opset1">
			<data element_type="f32" offset="9406364" shape="16,1,1,1,1" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="StatefulPartitionedCall/3d_unet_decathlon/encode_a_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy3085118" type="Const" version="opset1">
			<data element_type="f32" offset="9406428" shape="16,1,3,3,3" size="1728"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_a_bn_0/FusedBatchNormV3/mean/Fused_Mul__copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="StatefulPartitionedCall/3d_unet_decathlon/encode_a_conv_0/Conv3D/ReadVariableOp:0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="StatefulPartitionedCall/3d_unet_decathlon/encode_a_conv_0/Conv3D/fq_weights_1" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="255"/>
			<input>
				<port id="0">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="mrimages/Transpose([0 4 1 2 3])/value9268132753065412" type="Const" version="opset1">
			<data element_type="i64" offset="9408156" shape="5" size="40"/>
			<rt_info>
				<attribute name="fused_names" value="mrimages/Transpose([0 4 1 2 3])/value926813275" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="212621305397" type="Const" version="opset1">
			<data element_type="f32" offset="9408196" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="144" name="212721314740" type="Const" version="opset1">
			<data element_type="f32" offset="9408200" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="145" name="212821325532" type="Const" version="opset1">
			<data element_type="f32" offset="9408196" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="146" name="212921334680" type="Const" version="opset1">
			<data element_type="f32" offset="9408200" shape="" size="4"/>
			<output>
				<port id="0" precision="FP32"/>
			</output>
		</layer>
		<layer id="148" name="mrimages/Transpose([0 4 1 2 3])/fq_input_0" type="FakeQuantize" version="opset1">
			<data auto_broadcast="numpy" levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>1</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="149" name="mrimages/Transpose([0 4 1 2 3])" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="mrimages/Transpose([0 4 1 2 3])" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="150" name="StatefulPartitionedCall/3d_unet_decathlon/encode_a_conv_0/Conv3D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1,1" pads_begin="0,0,0" pads_end="0,0,0" strides="1,1,1"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_a_conv_0/Conv3D" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="151" name="data_add_70103105133" type="Const" version="opset1">
			<data element_type="f32" offset="9408204" shape="1,16,1,1,1" size="64"/>
			<rt_info>
				<attribute name="fused_names" value="data_add_7010" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="152" name="StatefulPartitionedCall/3d_unet_decathlon/encode_a_conv_0/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_a_conv_0/BiasAdd/Add/Fused_Add_" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/3d_unet_decathlon/encode_a_bn_0/FusedBatchNormV3:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</output>
		</layer>
		<layer id="153" name="StatefulPartitionedCall/3d_unet_decathlon/encode_a_relu_0/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="StatefulPartitionedCall/3d_unet_decathlon/encode_a_relu_0/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>144</dim>
					<dim>144</dim>
				</port>
			</input>
			<output>
